<script setup>
import { ref, onMounted } from "vue";
import * as later from "@breejs/later";

const doaas = [
  [
    "اللهمَّ مالكَ الملكِ تُؤتي الملكَ مَن تشاءُ، وتنزعُ الملكَ ممن تشاءُ، وتُعِزُّ مَن تشاءُ، وتذِلُّ مَن تشاءُ، بيدِك الخيرُ إنك على كلِّ شيءٍ قديرٌ رحمنُ الدنيا والآخرةِ ورحيمُهما، تعطيهما من تشاءُ، وتمنعُ منهما من تشاءُ، ارحمْني رحمةً تُغنيني بها عن رحمةِ مَن سواك.",
  ],
  [
    "اللهمَّ إني عبدُك وابنُ عبدِك وابنُ أَمَتِك ناصيتي بيدِك ماضٍ فيَّ حكمُك عَدْلٌ فيَّ قضاؤُك أسألُك بكلِّ اسمٍ هو لك سميتَ به نفسَك أو أنزلتَه في كتابِك أو علَّمتَه أحدًا مِنْ خلقِك أو استأثرتَ به في علمِ الغيبِ عندَك أنْ تجعلَ القرآنَ ربيعَ قلبي ونورَ صدري وجلاءَ حُزْني وذَهابَ هَمِّي",
  ],
  [
    `اللَّهمَّ رَحمَتَكَ أرْجو، فلا تَكِلْني إلى نَفْسي طَرْفةَ عَيْنٍ، أصْلِحْ لي شَأْني كُلَّهُ، لا إلهَ إلَّا أنتَ
لا إلَهَ إلَّا اللَّهُ العَظِيمُ الحَلِيمُ، لا إلَهَ إلَّا اللَّهُ رَبُّ السَّمَوَاتِ والأرْضِ، ورَبُّ العَرْشِ العَظِيمِ.`,
  ],
  ["اللهم سخر لي الأرزاق والفتوحات كل ساعة وهون علي كل صعب ويسر على كل عسير."],
  [
    " يَا أَبَا حَمْزَةَ مَا لَكَ إِذَا أَتَى بِكَ أَمْرٌ تَخَافُهُ أَنْ لَا تَتَوَجَّهَ إِلَى بَعْضِ زَوَايَا بَيْتِكَ ــ يَعْنِي الْقِبْلَةَ ــ فَتُصَلِّيَ رَكْعَتَيْنِ ثُمَّ تَقُولَ : يَا أَبْصَرَ النَّاظِرِينَ وَ يَا أَسْمَعَ السَّامِعِينَ ...",
  ],
  //   [],
  //   [],
  //   [],
];
let index = 0;
const doaa = ref(doaas[index][0]);
const nextDoaa = () => {
  if (index === doaas.length) {
    index = 0;
  }
  doaa.value = doaas[index][Math.floor(Math.random() * doaas[index].length)];
  index++;
};

const sched = later.parse.recur().every(3).hour();
later.setInterval(nextDoaa, sched);
</script>

<template>
  <section class="mx-auto w-[80%] md:w-[500px] text-center my-[50px] text-xs">
    <p>قسم أدعية لتذكير المسلم و المسلمة و كذلك لكسب الحسنات</p>
    <h5 class="text-sm font-bold mt-3 leading-[25px]">{{ doaa }}</h5>
  </section>
</template>

<style scoped></style>
